In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("loan_sanction_test.csv")
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [3]:
data.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            367 non-null    object
 1   Gender             356 non-null    object
 2   Married            367 non-null    object
 3   Dependents         357 non-null    object
 4   Education          367 non-null    object
 5   Self_Employed      344 non-null    object
 6   ApplicantIncome    367 non-null    int64
 7   CoapplicantIncome  367 non-null    int64
 8   LoanAmount         362 non-null    float64
 9   Loan_Amount_Term   361 non-null    float64
 10  Credit_History     338 non-null    float64
 11  Property_Area      367 non-null    object
dtypes: float64(3), int64(2), object(7)
memory usage: 34.5+ KB

In [9]:
data.ffill(axis=1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,360.0,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban
...,...,...,...,...,...,...,...,...,...,...,...,...
362,LP002971,Male,Yes,3+,Not Graduate,Yes,4009,1777,113.0,360.0,1.0,Urban
363,LP002975,Male,Yes,0,Graduate,No,4158,709,115.0,360.0,1.0,Urban
364,LP002980,Male,No,0,Graduate,No,3250,1993,126.0,360.0,360.0,Semiurban
365,LP002986,Male,Yes,0,Graduate,No,5000,2393,158.0,360.0,1.0,Rural
366,LP002989,Male,No,0,Graduate,Yes,9200,0,98.0,180.0,1.0,Rural

In [11]:
data["Gender"].mode()[0]

'Male'

In [14]:
data["Gender"].fillna(data["Gender"].mode()[0],inplace=True)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            367 non-null    object
 1   Gender             367 non-null    object
 2   Married            367 non-null    object
 3   Dependents         357 non-null    object
 4   Education          367 non-null    object
 5   Self_Employed      344 non-null    object
 6   ApplicantIncome    367 non-null    int64
 7   CoapplicantIncome  367 non-null    int64
 8   LoanAmount         362 non-null    float64
 9   Loan_Amount_Term   361 non-null    float64
 10  Credit_History     338 non-null    float64
 11  Property_Area      367 non-null    object
dtypes: float64(3), int64(2), object(7)
memory usage: 34.5+ KB

In [17]:
data.select_dtypes(include="object").isnull().sum()

Loan_ID           0
Gender            0
Married           0
Dependents       10
Education         0
Self_Employed    23
Property_Area     0
dtype: int64

In [21]:
for i in data.select_dtypes(include="object").columns:
    print(i)

Loan_ID
Gender
Married
Dependents
Education
Self_Employed
Property_Area

In [27]:
for i in data.select_dtypes(include="object").columns:
    data[i].fillna(data[i].mode()[0])

In [28]:
data.select_dtypes(include="object").isnull().sum()

Loan_ID          0
Gender           0
Married          0
Dependents       0
Education        0
Self_Employed    0
Property_Area    0
dtype: int64

In [38]:
data.select_dtypes(include="float64").columns

Index(['LoanAmount', 'Loan_Amount_Term', 'Credit_History'], dtype='object')

In [39]:
from sklearn.impute import SimpleImputer

In [40]:
si=SimpleImputer(strategy="mean")
ar=si.fit_transform(data[['LoanAmount', 'Loan_Amount_Term', 'Credit_History']])

In [41]:
new_data=pd.DataFrame(ar,columns=data.select_dtypes(include="float64").columns)

In [42]:
new_data.isnull().sum()

LoanAmount          0
Loan_Amount_Term    0
Credit_History      0
dtype: int64

In [43]:
new_data

     LoanAmount  Loan_Amount_Term  Credit_History
0         110.0             360.0        1.000000
1         126.0             360.0        1.000000
2         208.0             360.0        1.000000
3         100.0             360.0        0.825444
4          78.0             360.0        1.000000
..          ...               ...             ...
362       113.0             360.0        1.000000
363       115.0             360.0        1.000000
364       126.0             360.0        0.825444
365       158.0             360.0        1.000000
366        98.0             180.0        1.000000

[367 rows x 3 columns]

In [44]:
data["LoanAmount"].mean()

np.float64(136.13259668508286)

In [45]:
data.select_dtypes(include="int64").columns

Index(['ApplicantIncome', 'CoapplicantIncome'], dtype='object')

In [46]:
ar1=si.fit_transform(data[['ApplicantIncome', 'CoapplicantIncome']])

In [47]:
new_data1=pd.DataFrame(ar1,columns=data.select_dtypes(include="int64").columns)

In [48]:
new_data1

     ApplicantIncome  CoapplicantIncome
0             5720.0                0.0
1             3076.0             1500.0
2             5000.0             1800.0
3             2340.0             2546.0
4             3276.0                0.0
..               ...                ...
362           4009.0             1777.0
363           4158.0              709.0
364           3250.0             1993.0
365           5000.0             2393.0
366           9200.0                0.0

[367 rows x 2 columns]

In [49]:
new_data1.isnull().sum()

ApplicantIncome      0
CoapplicantIncome    0
dtype: int64